app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "categories" SET "description" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["description", "dsadasdasdasddsdsd"], ["updated_at", "2022-08-25 14:10:52.697199"], ["id", 6]]
---
  def update
    @category = Category.find(params[:id])

    if @category.update(category_params)

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fsdfsdf"], ["description", "gfgfdgfdgfdgdf"], ["created_at", "2022-08-28 15:27:54.084578"], ["updated_at", "2022-08-28 15:27:54.084578"]]
---
  def create
    @category = Category.new(category_params)
    @category.update(user_id: current_user.id)

    if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def correct_user
    @category =current_user.categories.find_by(id: params[:id])