app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "created_at", "updated_at", "category_id", "details", "task_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "dsfsdfdsfsd"], ["created_at", "2022-08-27 09:55:11.452154"], ["updated_at", "2022-08-27 09:55:11.452154"], ["category_id", 2], ["details", nil], ["task_id", nil]]
---
  def create
    @task = @category.tasks.build(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."created_at" BETWEEN $2 AND $3  [["category_id", 2], ["created_at", "2022-08-27 00:00:00"], ["created_at", "2022-08-27 23:59:59.999999"]]
---
  def tasks_today
    @tasks = @category.tasks.where(created_at: Date.today.beginning_of_day..Date.today.end_of_day)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 2], ["id", nil], ["LIMIT", 1]]
---
  def show
    @task = @category.tasks.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def edit

    # @task = @category.tasks.find(@task)
    # @category = Category.find(params[:category_id])
    @task = @category.tasks.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "details" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2022-08-27 12:20:53.612175"], ["details", "bnbmbnmnbmnb"], ["id", 1]]
---
  def update

    @task = @category.tasks.find(params[:id])

    if @task.update(task_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def get_category
    @category = Category.find(params[:category_id])