app/views/categories/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1  [["category_id", 2]]
---

  <% @category.tasks.each do |task| %>